---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.#ctor(Autodesk.Revit.DB.FillGrid)
source: html/1bba468c-570b-5042-209a-2a1250704b19.htm
---
# Autodesk.Revit.DB.FillGrid.#ctor Method

Constructs a new FillGrid with default settings.

## Syntax (C#)
```csharp
public FillGrid(
	FillGrid other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.FillGrid`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null